In [39]:
import pandas as pd

In [40]:
df=pd.read_csv("train.csv")
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [41]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [45]:
df=df.fillna(method="bfill")

In [46]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [47]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
df["Sex"]=le.fit_transform(df["Sex"])
df["Cabin"]=le.fit_transform(df["Cabin"])
df["Embarked"]=le.fit_transform(df["Embarked"])

In [48]:
x=df.iloc[:,0:12]
x=x.drop(["Survived","Name","Ticket"],axis=1)
x.head(5)

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare  Cabin  Embarked
0            1       3    1  22.0      1      0   7.2500     81         2
1            2       1    0  38.0      1      0  71.2833     81         0
2            3       3    0  26.0      0      0   7.9250     81         2
3            4       1    0  35.0      1      0  53.1000     55         2
4            5       3    1  35.0      0      0   8.0500     55         2

In [49]:
y=df.iloc[:,1]
y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [50]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,train_size=0.25,random_state=0)

In [51]:
from sklearn.linear_model import LogisticRegression
lg=LogisticRegression(solver='liblinear')
lg.fit(x_train,y_train)
y_pred=lg.predict(x_test)

In [52]:
from sklearn.metrics import confusion_matrix
confusion_matrix(y_test,y_pred)

array([[346,  74],
       [ 77, 172]], dtype=int64)

In [53]:
from sklearn.metrics import accuracy_score
accuracy_score(y_test,y_pred)

0.7742899850523169

In [54]:
df1=pd.read_csv("test.csv")
df1.head(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [56]:
df1=df1.fillna(method="ffill")

In [57]:
df1.isnull().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [58]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
df1["Sex"]=le.fit_transform(df1["Sex"])
df1["Cabin"]=le.fit_transform(df1["Cabin"])
df1["Embarked"]=le.fit_transform(df1["Embarked"])

In [59]:
X=df1.iloc[:,0:12]
X=X.drop(["Name","Ticket"],axis=1)
X.head(5)

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare  Cabin  Embarked
0          892       3    1  34.5      0      0   7.8292     12         1
1          893       3    0  47.0      1      0   7.0000     12         2
2          894       2    1  62.0      0      0   9.6875     12         1
3          895       3    1  27.0      0      0   8.6625     12         2
4          896       3    0  22.0      1      1  12.2875     12         2

In [74]:
Y=lg.predict(X)

In [75]:
dic={"PassengerId":df1["PassengerId"],"Survived":Y}

In [76]:
df2 = pd.DataFrame(dic)

In [77]:
df2.to_csv('file2.csv',index=False)